iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
						// Putar balik
						case 9:
							if(eTaskGetState(BallPicker_Handle) == eSuspended) {
								vTaskDelay(1000 / portTICK_PERIOD_MS);
								speed += 32;
								autoIndex++;
								vTaskResume(RevolverMove90_Handle);
								proboStop = false;
								proboLeftTurnReverse = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						case 10:
							if(proboLeftTurnReverse && (EncR_Count == (turnEncR_Count - 525))) {
								speed -= 32;
								autoIndex = 0;
								pid.Reset();
								proboLeftTurnReverse = false;
								proboState = PROBO_AUTO_DELIVER_BALL;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DELIVER_BALL:
					if(eTaskGetState(BallInserting_Handle) == eSuspended) {
						vTaskResume(BallInserting_Handle);
					}
					switch(autoIndex) {
						case 0:
							autoIndex++;
							proboForward = true;
							break;

						// Percabangan T
						case 1:
							if(!LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3]) {
								proboForward = false;
								proboStop = true;
								vTaskDelay(5000 / portTICK_PERIOD_MS);
								proboStop = false;
								speed += 32;
								autoIndex = 0;
								proboLeftTurnForward = true;
								turnEncR_Count = EncR_Count;
								proboState = PROBO_AUTO_DROP_BALL_1;
							}
							break;

						default:
							break;

					}
					break;

				case PROBO_AUTO_DROP_BALL_1:
					if(eTaskGetState(BallInserting_Handle) != eSuspended) {
						vTaskSuspend(BallInserting_Handle);
					}
					if(ballColor != ORANGE && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Belok kiri
						case 0:
							if(proboLeftTurnForward && (EncR_Count == (turnEncR_Count + 235))) {
								speed -= 32;
								autoIndex++;
								pid.Reset();
								proboLeftTurnForward = false;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Percabangan kanan drop bola 1
						case 1:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 100)) && (EncL_Count >= (turnEncL_Count + 100))) {
								autoIndex++;
								proboForward = false;
								proboStop = true;
							}
							break;

						// Mundur kanan
						case 2:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							speed += 32;
							autoIndex++;
							proboStop = false;
							proboRightTurnReverse = true;
							turnEncL_Count = EncL_Count;
							break;

						case 3:
							if(proboRightTurnReverse && (EncL_Count == (turnEncL_Count - 245))) {
								speed -= 32;
								autoIndex++;
								proboRightTurnReverse = false;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Mundur lurus
						case 4:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 30)) && (EncL_Count <= (turnEncL_Count - 30))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 1
						case 5:
							if(ballColor == ORANGE && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

						// Maju ke drop bola 2
						case 6:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_DROP_BALL_2;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DROP_BALL_2:
					if(ballColor != WHITE && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Percabangan T drop bola 1
						case 0:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Belok kanan arah drop bola 2
						case 1:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 276))) {
								autoIndex++;
								pid.Reset();
								proboRightTurnForward = false;
							}
							break;

						// Percabangan kanan drop bola 2
						case 2:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 3:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 218)) && (EncL_Count >= (turnEncL_Count + 218))) {
								autoIndex++;
								proboForward = false;
								proboStop = true;
							}
							break;

						// Mundur kanan
						case 4:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							proboStop = false;
							proboRightTurnReverse = true;
							turnEncL_Count = EncL_Count;
							break;

						case 5:
							if(proboRightTurnReverse && (EncL_Count == (turnEncL_Count - 276))) {
								autoIndex++;
								proboRightTurnReverse = false;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Mundur lurus
						case 6:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 100)) && (EncL_Count <= (turnEncL_Count - 100))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 2
						case 7:
							if(ballColor == WHITE && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

