iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
						// Maju ke drop bola 3
						case 8:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_DROP_BALL_3;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DROP_BALL_3:
					if(ballColor != WHITE && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Percabangan T drop bola 2
						case 0:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Belok kanan arah drop bola 3
						case 1:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 276))) {
								autoIndex++;
								pid.Reset();
								proboRightTurnForward = false;
							}
							break;

						// Percabangan kanan drop bola 3
						case 2:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 3:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 218)) && (EncL_Count >= (turnEncL_Count + 218))) {
								autoIndex++;
								proboForward = false;
								proboStop = true;
							}
							break;

						// Mundur kanan
						case 4:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							proboStop = false;
							proboRightTurnReverse = true;
							turnEncL_Count = EncL_Count;
							break;

						case 5:
							if(proboRightTurnReverse && (EncL_Count == (turnEncL_Count - 276))) {
								autoIndex++;
								proboRightTurnReverse = false;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Mundur lurus
						case 6:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 100)) && (EncL_Count <= (turnEncL_Count - 100))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 3
						case 7:
							if(ballColor == WHITE && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

						// Maju ke drop bola 4
						case 8:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_DROP_BALL_4;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_DROP_BALL_4:
					if(ballColor != ORANGE && eTaskGetState(RevolverMove90_Handle) == eSuspended && eTaskGetState(BallDropping_Handle) == eSuspended) {
						vTaskResume(RevolverMove90_Handle);
					}
					switch(autoIndex) {
						// Percabangan T drop bola 3
						case 0:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Belok kanan arah drop bola 4
						case 1:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 276))) {
								autoIndex++;
								pid.Reset();
								proboRightTurnForward = false;
							}
							break;

						// Percabangan kanan drop bola 4
						case 2:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 3:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 218)) && (EncL_Count >= (turnEncL_Count + 218))) {
								autoIndex++;
								proboForward = false;
								proboStop = true;
							}
							break;

						// Mundur kanan
						case 4:
							vTaskDelay(500 / portTICK_PERIOD_MS);
							autoIndex++;
							proboStop = false;
							proboRightTurnReverse = true;
							turnEncL_Count = EncL_Count;
							break;

						case 5:
							if(proboRightTurnReverse && (EncL_Count == (turnEncL_Count - 276))) {
								autoIndex++;
								proboRightTurnReverse = false;
								proboReverse = true;
								turnEncR_Count = EncR_Count;
								turnEncL_Count = EncL_Count;
							}
							break;

						// Mundur lurus
						case 6:
							if(proboReverse && (EncR_Count <= (turnEncR_Count - 100)) && (EncL_Count <= (turnEncL_Count - 100))) {
								autoIndex++;
								proboReverse = false;
								proboStop = true;
								startTimeout = millis();
							}
							break;

						// Drop bola 4
						case 7:
							if(ballColor == ORANGE && eTaskGetState(RevolverMove90_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex++;
								vTaskResume(BallDropping_Handle);
							}
							currTimeout = millis();
							if((currTimeout - startTimeout) >= dropBallTimeout) {
								autoIndex++;
							}
							break;

						// Maju ke mode manual
						case 8:
							if(eTaskGetState(BallDropping_Handle) == eSuspended) {
								vTaskDelay(500 / portTICK_PERIOD_MS);
								autoIndex = 0;
								pid.Reset();
								proboStop = false;
								proboState = PROBO_AUTO_SEARCH_MANUAL;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_AUTO_SEARCH_MANUAL:
					switch(autoIndex) {
						// Percabangan T drop bola 3
						case 0:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboLeftTurnForward = true;
								turnEncR_Count = EncR_Count;
							}
							break;

						// Belok kiri arah manual
						case 1:
							if(proboLeftTurnForward && (EncR_Count == (turnEncR_Count + 276))) {
								autoIndex++;
								pid.Reset();
								proboLeftTurnForward = false;
							}
							break;

						// Percabangan kiri drop bola 3
						case 2:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && LTSensor[7] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								pid.Reset();
							}
							break;

