iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
						// Percabangan kiri drop bola 2
						case 3:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && LTSensor[7] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan kiri drop bola 1
						case 4:
							if(LTSensor[6] && !LTSensor[0] && !LTSensor[4] && !LTSensor[2] && !LTSensor[5] && LTSensor[7] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								pid.Reset();
							}
							break;

						// Percabangan kanan
						case 5:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								pid.Reset();
							}
							break;

						// Belok kanan 90
						case 6:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && !LTSensor[2] && !LTSensor[5] && !LTSensor[7] && !LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboRightTurnForward = true;
								turnEncL_Count = EncL_Count;
							}
							break;

						case 7:
							if(proboRightTurnForward && (EncL_Count == (turnEncL_Count + 276))) {
								autoIndex++;
								pid.Reset();
								proboRightTurnForward = false;
							}
							break;

						// Masuk kotak manual
						case 8:
							if(LTSensor[6] && LTSensor[0] && LTSensor[4] && LTSensor[2] && LTSensor[5] && LTSensor[7] && LTSensor[3] && LTSensor[1]) {
								autoIndex++;
								proboForward = true;
							}
							break;

						case 9:
							if(proboForward && (EncR_Count >= (turnEncR_Count + 200)) && (EncL_Count >= (turnEncL_Count + 200))) {
								autoIndex = 0;
								proboForward = false;
								proboStop = true;
							}
							break;

						default:
							break;
					}
					break;

				case PROBO_MANUAL_RUNNING:
					break;

				case PROBO_MANUAL_PICK_BALL:
					break;

				case PROBO_MANUAL_SHOOT_BALL:
					break;

				default:
					buzzer.writeNote(NOTE_C, 6);
					vTaskDelay(100 / portTICK_PERIOD_MS);
					buzzer.write(0);
					vTaskDelay(100 / portTICK_PERIOD_MS);
					break;
			}
		}
		vTaskDelay(1 / portTICK_PERIOD_MS);
	}
}

void LTSensRead(void *pvParameters) {
	for(;;) {
		for(uint8_t i = 0; i < 8; i++) {
			digitalWrite(MUX_A0, i & (1 << 2));
			digitalWrite(MUX_A1, i & (1 << 1));
			digitalWrite(MUX_A2, i & 1);
			vTaskDelay(1 / portTICK_PERIOD_MS);
			if(proboState == PROBO_CONFIG) {
				LTSensor[i] = 255 - analogRead(LT_SENS_ADC);
			} else {
				int LTSensCal = map(255 - analogRead(LT_SENS_ADC), LTSensor_LOW[i], LTSensor_HIGH[i], 0, 255);
				if(LTSensCal < LTThreshold) {
					LTSensor[i] = 0;
				} else if(LTSensCal > LTThreshold) {
					LTSensor[i] = 255;
				}
			}
		}
	}
}

void RevolverMove90(void *pvParameters) {
	for(;;) {
		digitalWrite(STEPPER_STEP, HIGH);
		vTaskDelay(1 / portTICK_PERIOD_MS);
		digitalWrite(STEPPER_STEP, LOW);
		vTaskDelay(1 / portTICK_PERIOD_MS);
		stepCount++;
		if(stepCount == 512) {
			vTaskDelay(1000 / portTICK_PERIOD_MS);
			stepCount = 0;
			vTaskSuspend(RevolverMove90_Handle);
		}
	}
}

void Motor(void *pvParameters) {
	for(;;) {
		if(proboState >= PROBO_AUTO_SEARCH_BALL && proboState <= PROBO_AUTO_SEARCH_MANUAL) {
			if(proboRightTurnForward) {
				rightMotor1.write(0);
				rightMotor2.write(0);
				leftMotor1.write(speed * 1.25);
				leftMotor2.write(0);
			} else if(proboLeftTurnForward) {
				rightMotor1.write(0);
				rightMotor2.write(speed * 1.25);
				leftMotor1.write(0);
				leftMotor2.write(0);
			} else if(proboRightTurnReverse) {
				rightMotor1.write(0);
				rightMotor2.write(0);
				leftMotor1.write(0);
				leftMotor2.write(speed * 1.25);
			} else if(proboLeftTurnReverse) {
				rightMotor1.write(speed * 1.25);
				rightMotor2.write(0);
				leftMotor1.write(0);
				leftMotor2.write(0);
			} else if(proboForward) {
				rightMotor1.write(0);
				rightMotor2.write(speed * 1.2);
				leftMotor1.write(speed * 1.1);
				leftMotor2.write(0);
			} else if(proboReverse) {
				rightMotor1.write(speed * 1.2);
				rightMotor2.write(0);
				leftMotor1.write(0);
				leftMotor2.write(speed * 1.1);
			} else if(proboStop) {
				rightMotor1.write(0);
				rightMotor2.write(0);
				leftMotor1.write(0);
				leftMotor2.write(0);
			} else {
				rightMotor1.write(0);
				rightMotor2.write(speed - (PIDOutput * 0.1));
				leftMotor1.write(speed + (PIDOutput * 0.1));
				leftMotor2.write(0);
			}
		} else if(proboState >= PROBO_MANUAL_RUNNING) {
			rightMotor1.write(-(leftAxisY - 127) + (rightAxisX - 127));
			rightMotor2.write((leftAxisY - 127) - (rightAxisX - 127));
			leftMotor1.write((leftAxisY - 127) + (rightAxisX - 127));
			leftMotor2.write(-(leftAxisY - 127) - (rightAxisX - 127));
		} else {
			rightMotor1.write(0);
			rightMotor2.write(0);
			leftMotor1.write(0);
			leftMotor2.write(0);
		}
		vTaskDelay(1 / portTICK_PERIOD_MS);
	}
}

void PID(void *pvParameters) {
	for(;;) {
		PIDInput = (LTSensor[5] * 0.1) + (LTSensor[7] * 0.4) + (LTSensor[3] * 1.6) + (LTSensor[1] * 6.4) - (LTSensor[6] * 6.4) - (LTSensor[0] * 1.6) - (LTSensor[4] * 0.4) - (LTSensor[2] * 0.1);
		pid.Compute();
		vTaskDelay(50 / portTICK_PERIOD_MS);
	}
}

void BallPicker(void *pvParameters) {
	for(;;) {
		if(proboState == PROBO_MANUAL_RUNNING) {
			proboState = PROBO_MANUAL_PICK_BALL;
		} else {
			proboState = PROBO_AUTO_PICK_BALL;
		}
		servo1.write(0);
		servo2.write(180);
		vTaskDelay(1000 / portTICK_PERIOD_MS);
		servo1.write(90);
		servo2.write(90);
		if(proboState == PROBO_MANUAL_PICK_BALL) {
			proboState = PROBO_MANUAL_RUNNING;
		}
		vTaskSuspend(BallPicker_Handle);
	}
}

void BallShooting(void *pvParameters) {
	for(;;) {
		if(proboState == PROBO_MANUAL_RUNNING) {
			proboState = PROBO_MANUAL_SHOOT_BALL;
		}
		digitalWrite(MOTOR_S_REL, HIGH);
		vTaskDelay(800 / portTICK_PERIOD_MS);
		servo5.write(0);
		vTaskDelay(700 / portTICK_PERIOD_MS);
		servo5.write(2);
		vTaskDelay(500 / portTICK_PERIOD_MS);
		servo5.write(90);
		digitalWrite(MOTOR_S_REL, LOW);
		vTaskDelay(1500 / portTICK_PERIOD_MS);
		if(proboState == PROBO_MANUAL_SHOOT_BALL) {
			proboState = PROBO_MANUAL_RUNNING;
		}
		vTaskSuspend(BallShooting_Handle);
	}
}

