iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
void BallDropping(void *pvParameters) {
	for(;;) {
		if(proboState == PROBO_MANUAL_RUNNING) {
			proboState = PROBO_MANUAL_SHOOT_BALL;
		}
		servo5.write(0);
		vTaskDelay(700 / portTICK_PERIOD_MS);
		servo5.write(2);
		vTaskDelay(500 / portTICK_PERIOD_MS);
		servo5.write(90);
		vTaskDelay(1500 / portTICK_PERIOD_MS);
		if(proboState == PROBO_MANUAL_SHOOT_BALL) {
			proboState = PROBO_MANUAL_RUNNING;
		}
		vTaskSuspend(BallDropping_Handle);
	}
}

void ArmPushBall(void *pvParameters) {
	for(;;) {
		servo1.write(123);
		servo2.write(57);
		vTaskDelay(500 / portTICK_PERIOD_MS);
		servo1.write(90);
		servo2.write(90);
		vTaskSuspend(ArmPushBall_Handle);
	}
}

void BallInserting(void *pvParameters) {
	for(;;) {
		if(eTaskGetState(RevolverMove90_Handle) == eSuspended) {
			vTaskResume(RevolverMove90_Handle);
			vTaskDelay(1500 / portTICK_PERIOD_MS);
			vTaskResume(ArmPushBall_Handle);
		}
	}
}

void SimMode(void *pvParameters) {
	for(;;) {
		if(startPoint) { // Start Point Blue
			switch(simStartPacketCount) {
				#pragma region Sim LT 90 Degrees
				case 0: // Starting
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;

				case 20: // Kotak start
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;

				case 40: // Garis awal
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;

				case 100: // Belok kotak 90 kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;

				case 120: // Garis lurus kedua
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 200: // Belok kotak 90 kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 220: // Garis lurus ketiga
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 300: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Pick Ball
				case 500: // Garis lurus dari bola
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 600: // Percabangan kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 610: // Garis lurus
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 700: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 720: // Garis lurus arah drop bola
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 760: // Percabangan drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Drop Ball 1
				case 770: // Garis lurus dari drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 1100: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 1120: // Garis lurus arah drop bola 2
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 1200: // Percabangan drop bola 2
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Drop Ball 2
				case 1210: // Garis lurus dari drop bola 2
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 1500: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
