iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
				case 1520: // Garis lurus arah drop bola 3
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 1600: // Percabangan drop bola 3
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Drop Ball 3
				case 1610: // Garis lurus dari drop bola 3
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 1900: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 1920: // Garis lurus arah drop bola 4
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2000: // Percabangan drop bola 4
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT After Drop Ball 4
				case 2010: // Garis lurus dari drop bola 4
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2300: // Percabangan T
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 2320: // Garis lurus arah drop bola 3
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2400: // Percabangan drop bola 3
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 2410: // Garis lurus arah drop bola 2
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2500: // Percabangan drop bola 2
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 2510: // Garis lurus arah drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2600: // Percabangan drop bola 1
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 0;
					LTSensor[3] = 0;
					LTSensor[1] = 255;
					break;
					
				case 2610: // Garis lurus arah manual
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2700: // Percabangan kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2710: // Garis lurus kedua
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 2800: // Belok kotak 90 kiri
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 0;
					LTSensor[4] = 0;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				#pragma endregion

				#pragma region Sim LT Curve
				case 2820: // Garis lurus pertama
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 0;
					LTSensor[5] = 0;
					LTSensor[7] = 255;
					LTSensor[3] = 255;
					LTSensor[1] = 255;
					break;
					
				case 3000: // Curve kanan
					buzzer.writeNote(NOTE_E, 5);
					LTSensor[6] = 255;
					LTSensor[0] = 255;
					LTSensor[4] = 255;
					LTSensor[2] = 255;
					LTSensor[5] = 255;
					LTSensor[7] = 255;
					LTSensor[3] = 0;
					LTSensor[1] = 0;
					break;
					
