iwa1836/PROBO-Kel-2/PROBO_ESP32/PROBO_NEW.cpp
				if((buttons & 0x0010) && (proboState > PROBO_AUTO_SEARCH_MANUAL || proboState < PROBO_AUTO_SEARCH_BALL)) {
					proboState = PROBO_AUTO_SEARCH_BALL;
					pid.Reset();
					autoIndex = 0;
					proboRightTurnForward = false;
					proboLeftTurnForward = false;
					proboRightTurnReverse = false;
					proboLeftTurnReverse = false;
					proboForward = false;
					proboReverse = false;
					proboStop = false;
					if(simModeState && (eTaskGetState(SimMode_Handle) == eSuspended)) {
						simStartPacketCount = 0;
						vTaskResume(SimMode_Handle);
					}
				} else if(buttons & 0x0020) {
					proboState = PROBO_MANUAL_RUNNING;
					vTaskSuspend(PID_Handle);
					if(simModeState) {
						buzzer.write(0);
						vTaskSuspend(SimMode_Handle);
					}
				} else if((buttons & 0x1000) && (eTaskGetState(BallPicker_Handle) == eSuspended) && (eTaskGetState(ArmPushBall_Handle) == eSuspended) && (proboState == PROBO_MANUAL_RUNNING)) {
					vTaskResume(BallPicker_Handle);
				} else if((buttons & 0x8000) && (eTaskGetState(ArmPushBall_Handle) == eSuspended) && (eTaskGetState(BallPicker_Handle) == eSuspended) && (proboState == PROBO_MANUAL_RUNNING)) {
					vTaskResume(ArmPushBall_Handle);
				} else if((buttons & 0x2000) && (eTaskGetState(BallShooting_Handle) == eSuspended) && (eTaskGetState(BallDropping_Handle) == eSuspended) && (eTaskGetState(RevolverMove90_Handle) == eSuspended) && (proboState == PROBO_MANUAL_RUNNING)) {
					vTaskResume(BallShooting_Handle);
				} else if((buttons & 0x4000) && (eTaskGetState(BallDropping_Handle) == eSuspended) && (eTaskGetState(BallShooting_Handle) == eSuspended) && (eTaskGetState(RevolverMove90_Handle) == eSuspended) && (proboState == PROBO_MANUAL_RUNNING)) {
					vTaskResume(BallDropping_Handle);
				} else if((buttons & 0x0004) && (eTaskGetState(RevolverMove90_Handle) == eSuspended) && (eTaskGetState(BallShooting_Handle) == eSuspended) && (proboState >= PROBO_MANUAL_RUNNING)) {
					digitalWrite(STEPPER_DIR, KIRI);
					vTaskResume(RevolverMove90_Handle);
				} else if((buttons & 0x0008) && (eTaskGetState(RevolverMove90_Handle) == eSuspended) && (eTaskGetState(BallShooting_Handle) == eSuspended) && (proboState >= PROBO_MANUAL_RUNNING)) {
					digitalWrite(STEPPER_DIR, KANAN);
					vTaskResume(RevolverMove90_Handle);
				}
			}

			// Revolver Adjustment
			if((payload[0] == 0x5A) && (proboState == PROBO_CONFIG)) {
				buttons = (payload[1] << 8);
				buttons |= payload[2];

				if(buttons & 0x0004) {
					stepState = !stepState;
					digitalWrite(STEPPER_DIR, KIRI);
					digitalWrite(STEPPER_STEP, stepState);

				} else if(buttons & 0x0008) {
					stepState = !stepState;
					digitalWrite(STEPPER_DIR, KANAN);
					digitalWrite(STEPPER_STEP, stepState);
				}
			}
			break;
			
		default:
			break;
	}
}
#pragma endregion

#pragma region ISR
void IRAM_ATTR EncR_ISR() {
	lastEncR_Time = EncR_Time;
	EncR_Time = micros();
	motR_PPS = 1000000 / (EncR_Time - lastEncR_Time);
	if(digitalRead(ENCR_A)) {
		if(digitalRead(ENCR_B)) {
			EncR_Count--;
			motR_PPS = -motR_PPS;
		} else {
			EncR_Count++;
		}
	} else {
		if(digitalRead(ENCR_B)) {
			EncR_Count++;
		} else {
			EncR_Count--;
			motR_PPS = -motR_PPS;
		}
	}
}

void IRAM_ATTR EncL_ISR() {
	lastEncL_Time = EncL_Time;
	EncL_Time = micros();
	motL_PPS = 1000000 / (EncL_Time - lastEncL_Time);
	if(digitalRead(ENCL_A)) {
		if(digitalRead(ENCL_B)) {
			EncL_Count++;
		} else {
			EncL_Count--;
			motL_PPS = -motL_PPS;
		}
	} else {
		if(digitalRead(ENCL_B)) {
			EncL_Count--;
			motL_PPS = -motL_PPS;
		} else {
			EncL_Count++;
		}
	}
}
#pragma endregion

#pragma region Main Program
void setup() {
	simModeState = false;

	analogReadResolution(8);

	for(uint8_t i = 0; i < 8; i++) {
		LTSensor_LOW[i] = 0;
		LTSensor_HIGH[i] = 255;
	}

	#pragma region Preferences Initialization
	preferences.begin("Config");
	startPoint = preferences.getBool("StartPoint", 0);
	Kp.floatVal = preferences.getFloat("Kp", 0);
	Ki.floatVal = preferences.getFloat("Ki", 0);
	Kd.floatVal = preferences.getFloat("Kd", 0);
	speed = preferences.getUChar("Speed", 0);
	LTThreshold = preferences.getUChar("LTThreshold", 0);
	ballThreshold = preferences.getUChar("BallThreshold", 0);
	#pragma endregion

	#pragma region pinMode
	pinMode(ENCR_A, INPUT_PULLUP);
	pinMode(ENCR_B, INPUT_PULLUP);
	pinMode(ENCL_A, INPUT_PULLUP);
	pinMode(ENCL_B, INPUT_PULLUP);

	pinMode(LT_SENS_ADC, INPUT);
	pinMode(PHOTODIODE_ADC, INPUT);
	
	pinMode(MUX_A0, OUTPUT);
	pinMode(MUX_A1, OUTPUT);
	pinMode(MUX_A2, OUTPUT);
	
	pinMode(BUZZ_PIN, OUTPUT);
	
	pinMode(MOTOR_S_REL, OUTPUT);
	pinMode(MOTOR_R_1, OUTPUT);
	pinMode(MOTOR_R_2, OUTPUT);
	pinMode(MOTOR_L_1, OUTPUT);
	pinMode(MOTOR_L_2, OUTPUT);

	pinMode(STEPPER_STEP, OUTPUT);
	pinMode(STEPPER_DIR, OUTPUT);
	#pragma endregion

	#pragma region attachInterrupt
	attachInterrupt(digitalPinToInterrupt(ENCR_A), EncR_ISR, CHANGE);
	attachInterrupt(digitalPinToInterrupt(ENCL_A), EncL_ISR, CHANGE);
	#pragma endregion

	#pragma region Wi-Fi Initialization
	WiFi.mode(WIFI_MODE_AP);
	WiFi.softAP(AP_SSID, AP_PASS);

	wsServer.begin();
	wsServer.onEvent(onWebSocketEvent);
	#pragma endregion

	#pragma region Servo Initialization
	servo1.setPeriodHertz(50);
	servo2.setPeriodHertz(50);
	servo5.setPeriodHertz(50);

	servo1.attach(SERVO_1);
	servo2.attach(SERVO_2);
	servo5.attach(SERVO_5);

	servo1.write(123);
	servo2.write(57);
	servo5.write(90);
	#pragma endregion

	#pragma region Buzzer Initialization
	buzzer.attachPin(BUZZ_PIN, 440, 8);
	buzzer.write(0);
	#pragma endregion

	#pragma region Motor Initialization
	rightMotor1.attachPin(MOTOR_R_1, 1000, 8);
	rightMotor2.attachPin(MOTOR_R_2, 1000, 8);
	leftMotor1.attachPin(MOTOR_L_1, 1000, 8);
	leftMotor2.attachPin(MOTOR_L_2, 1000, 8);
	#pragma endregion

	#pragma region PID Initialization
	pid.SetMode(QuickPID::Control::automatic);
	pid.SetAntiWindupMode(QuickPID::iAwMode::iAwClamp);
	pid.SetSampleTimeUs(50000);
	#pragma endregion

	proboState = PROBO_CONFIG;

	#pragma region Task Creations
	xTaskCreatePinnedToCore(ProboState, "ProboState", 4096, NULL, 1, &ProboState_Handle, 1);
	xTaskCreatePinnedToCore(LTSensRead, "LTSensRead", 2048, NULL, 1, &LTSensRead_Handle, 0);
	xTaskCreatePinnedToCore(Motor, "Motor", 2048, NULL, 1, &Motor_Handle, 1);
	vTaskSuspend(Motor_Handle);
	xTaskCreatePinnedToCore(PID, "PID", 2048, NULL, 2, &PID_Handle, 1);
	vTaskSuspend(PID_Handle);
	xTaskCreatePinnedToCore(RevolverMove90, "RevolverMove90", 2048, NULL, 1, &RevolverMove90_Handle, 1);
	vTaskSuspend(RevolverMove90_Handle);
	xTaskCreatePinnedToCore(BallPicker, "BallPicker", 2048, NULL, 1, &BallPicker_Handle, 1);
	vTaskSuspend(BallPicker_Handle);
	xTaskCreatePinnedToCore(BallShooting, "BallShooting", 2048, NULL, 1, &BallShooting_Handle, 1);
	vTaskSuspend(BallShooting_Handle);
	xTaskCreatePinnedToCore(BallDropping, "BallDropping", 2048, NULL, 1, &BallDropping_Handle, 1);
	vTaskSuspend(BallShooting_Handle);
	xTaskCreatePinnedToCore(ArmPushBall, "ArmPushBall", 2048, NULL, 1, &ArmPushBall_Handle, 1);
	vTaskSuspend(ArmPushBall_Handle);
	xTaskCreatePinnedToCore(BallInserting, "BallInserting", 2048, NULL, 1, &BallInserting_Handle, 1);
	vTaskSuspend(BallInserting_Handle);
	xTaskCreatePinnedToCore(SimMode, "SimMode", 2048, NULL, 1, &SimMode_Handle, 1);
	vTaskSuspend(SimMode_Handle);
	#pragma endregion
}

void loop() {
	wsServer.loop();
	
	ballADC = analogRead(PHOTODIODE_ADC);
	if(ballADC <= ballThreshold) {
		ballColor = WHITE;
	} else if(ballADC > ballThreshold && ballADC < 224) {
		ballColor = ORANGE;
	} else {
		ballColor = INVALID;
	}
	
	currMill = millis();
	if(currMill - prevMill >= sendingInterval) {
		prevMill = currMill;
		wsServer.broadcastBIN(telemetryData, sizeof(telemetryData));

		if(motR_PPS < 100 && motR_PPS > -100) {
			motR_PPS = 0;
		}
		if(motL_PPS < 100 && motL_PPS > -100) {
			motL_PPS = 0;
		}

		packetCount++;
		if(simModeState) {
			simStartPacketCount++;
		}

		if(proboState == PROBO_CONFIG) {
			telemetryData[0] = 0x55;
		} else {
			telemetryData[0] = 0xAA;
		}
		telemetryData[1] = packetCount >> 24;
		telemetryData[2] = packetCount >> 16;
		telemetryData[3] = packetCount >> 8;
		telemetryData[4] = packetCount;
		telemetryData[5] = proboState;
		telemetryData[6] = motR_PPS >> 8;
		telemetryData[7] = motR_PPS;
		telemetryData[8] = motL_PPS >> 8;
		telemetryData[9] = motL_PPS;
		telemetryData[10] = LTSensor[6];
		telemetryData[11] = LTSensor[0];
		telemetryData[12] = LTSensor[4];
		telemetryData[13] = LTSensor[2];
		telemetryData[14] = LTSensor[5];
		telemetryData[15] = LTSensor[7];
		telemetryData[16] = LTSensor[3];
		telemetryData[17] = LTSensor[1];
		telemetryData[18] = ballColor;
		telemetryData[19] = ballADC;
	}
}
#pragma endregion